{
    "language": "Language",
    "home": "Home",
    "about": "About",
    "contact": "Contact",
    "resume": "Resume",
    "portfolio": "Portfolio",
    "footer": "Ali Oliaee | created by",
    "and": "and",
    "name": "Ali",
    "family": "Oliaee",
    "home-description": "Front-end developer and a codeholic person",
    "about-title": "About Me",
    "Hi": "Hi",
    "about-description": "My name is Ali Oliaee and I am studying for a bachelor's degree in computer engineering at Qiet University.I was born at dec 20, 2001.I'm interested messing with computers and tech stuff. The purpose of this portfolio is the presentation of the personal projects I have worked on, and the skills I have acquired over the years.",
    "games": "Video games",
    "music": "Music",
    "movies": "Movies",
    "puzzle": "Puzzles",
    "open-source": "Open source",
    "walking": "Walking",
    "interests": "Interests",
    "contact-text": "if you have any questions or criticism, Do not delay and",
    "contact-me": "contact me",
    "contact-description": "you can contact me with this ways :)",
    "email": "Email",
    "call": "Call",
    "location": "Location",
    "my-location": "Iran, Mashhad",
    "social-media": "Social Media",
    "phone-number": "+989105753695",
    "phone-book": "Phone Book",
    "phone-book-description": "A phone book application that allows users to add, edit, and delete contacts. crud on sql using node js and help ant design library for ui.",
    "signup-page": "Signup Page",
    "signup-page-description": "A signup page for a user to signup and create an account, a challenge from frontend mentor website. created by react and ant design library.",
    "portfolio-description": "My portfolio website, created by react and MUI library. internationalized with i18next.",
    "calculator": "Calculator",
    "calculator-description": "A simple calculator that I made for fun contains oop javascript and neumorphism design.",
    "news-site": "News website",
    "news-site-description": "A news website with signup and login form, based on typescript, react. designed by ant design library and get content from fakerjs.",
    "demo": "Demo",
    "source-code": "Source code",
    "qr-card": "QR Card",
    "qr-card-description": "It's a challenge from frontend mentor website, a simple preview of QR card.",
    "instagram-ui": "Instagram-UI",
    "instagram-ui-description": "Just a simple UI that I made for Instagram. images are not loaded because Fakerjs library broke down. :(",
    "love-page": "Love Page",
    "love-page-description": "A simple HTML document that allows users to add their own messages to the page.",
    "rare-shop": "Rare Shop",
    "rare-shop-description": "A Dapp that allows users to buy stuff with crypto and it's connect to your metamask account. most used technologies are react, redux, etherjs.",
    "skills": "Skills",
    "experience": "Experience",
    "arashweb": "Arashweb",
    "arashweb-description": "I worked at ArashWeb Company as a frontend intern, During this time I have participated in several projects and also learned the main topics of the clean code book and met good friends and colleagues :)",
    "felixin":"Felixin",
    "felixin-intern-description" : "During this time, I was working with React Native as a mobile app development intern, and I got to know more about the development process of mobile apps and the differences between mobile operating systems. Most importantly, I touched the remote work culture closely.",
    "education": "Education",
    "education-description": "I am currently an undergraduate computer engineering student and have been studying since 2019.",
    "personality": "Personality",
    "trustworthy": "Trustworthy",
    "teamwork": "Teamwork",
    "learner": "Learner",
    "listener": "Listener",
    "learn-more": "Learn more...",
    "Download-cv": "Download my cv",
    "404": "404",
    "404-description": "The page you are looking for is not found.",
    "back-to-home": "Back to home",
    "learn-less": "Learn less",
    "show-all": "Show all",
    "intern": "Intern",
    "arashweb-date": "Nov 2021 - March 2022 (4mons)",
    "felixin-intern-date": "Oct 2022 - Nov 2022 (2mons)",
    "fulltime-remote": "Fulltime-Remote",
    "felixin-hire-date": "Nov 2022 - Present",
    "felixin-hire-description": "After completing the internship, I decided to deal with international projects and solve challenges in Felixin." ,
    "parents-app": "Parents App",
    "parents-app-description": "A mobile app that allows new parents to track their baby's growth and development. it's a complete project that I made with react native."
}